In [2]:
import pandas as pd
import numpy as np
import os

# CSV file reading
#### Comma Seperated Values file, default delimeter is comma, Delimeter can be any character like colon, semicolon, tab character etc

In [27]:
path=os.getcwd()

In [28]:
path

'D:\\MasterCopy-Notes\\Course Contents\\CJC-2\\Sessions\\Pandas'

In [32]:
path = path  + "\\..\\..\\Practice\\data\\"

In [33]:
path

'D:\\MasterCopy-Notes\\Course Contents\\CJC-2\\Sessions\\Pandas\\..\\..\\Practice\\data\\'

In [44]:
df = pd.read_csv(path + 'example',delimiter=',')    
# example file does not have extension and still we can read using read_csv
# Sep: optional ; default value is ,     delimeter and sep is same
#

In [45]:
df

         a        b       c          d
0  Shubham  Ruchika  Kushal     Milind
1    India      USA      UK     France
2      88K      99K     10K        11K
3     Pune   Mumbai   Delhi  Bangalore

In [49]:
pd.read_csv??

In [50]:
# file is delimeted by semicolon
df = pd.read_csv(path + 'exampleDelimetedBySemicolon.csv',sep=';')
df

  Column1 Column2     Column3    Column4
0  Yogesh   Vikas  Parivartan    Ruchika
1   India      UK      France      Japan
2    100K     99K         98K        97K
3    Pune  London       Paris  Hiroshima

In [51]:
df = pd.read_csv(path + 'example',delimiter=',', header=0) # file linestrts with 0

In [52]:
df

         a        b       c          d
0  Shubham  Ruchika  Kushal     Milind
1    India      USA      UK     France
2      88K      99K     10K        11K
3     Pune   Mumbai   Delhi  Bangalore

In [53]:
df = pd.read_csv(path + 'example',delimiter=',', header=1)
df

  Shubham Ruchika Kushal     Milind
0   India     USA     UK     France
1     88K     99K    10K        11K
2    Pune  Mumbai  Delhi  Bangalore

In [54]:
df = pd.read_csv(path + 'example',delimiter=',', header=2)   # considering 2nd row as a header and reads file below that row
df

  India     USA     UK     France
0   88K     99K    10K        11K
1  Pune  Mumbai  Delhi  Bangalore

In [55]:
df = pd.read_csv(path + 'example',delimiter=',', header=4)   #  4th row is considered as header
df

Empty DataFrame
Columns: [Pune, Mumbai, Delhi, Bangalore]
Index: []

In [56]:
df = pd.read_csv(path + 'example',delimiter=',', header=-1)   #  error  # interview question
df

ValueError: Passing negative integer to header is invalid. For no header, use header=None instead

In [57]:
df = pd.read_csv(path + 'example',names=['col1','col2','col3','col4'])   #  define header columns
df

      col1     col2    col3       col4
0        a        b       c          d
1  Shubham  Ruchika  Kushal     Milind
2    India      USA      UK     France
3      88K      99K     10K        11K
4     Pune   Mumbai   Delhi  Bangalore

In [58]:
df = pd.read_csv(path + 'example',names=['col1','col2','col3','col4'], header=1)   #  interview q1uestion
df

    col1    col2   col3       col4
0  India     USA     UK     France
1    88K     99K    10K        11K
2   Pune  Mumbai  Delhi  Bangalore

In [59]:
df = pd.read_csv(path + 'example',names=['col1','col2','col3','col4','col5'])   #  define header columns with extra column, which will have all NaNs
df

      col1     col2    col3       col4  col5
0        a        b       c          d   NaN
1  Shubham  Ruchika  Kushal     Milind   NaN
2    India      USA      UK     France   NaN
3      88K      99K     10K        11K   NaN
4     Pune   Mumbai   Delhi  Bangalore   NaN

In [60]:
df = pd.read_csv(path + 'example',names=['col1','col2'])   #  defines only 2 columns whereas 4 columns are presentin the file , makes first 2 columns as an index 
df

                   col1       col2
a       b             c          d
Shubham Ruchika  Kushal     Milind
India   USA          UK     France
88K     99K         10K        11K
Pune    Mumbai    Delhi  Bangalore

In [62]:
df.index

MultiIndex([(      'a',       'b'),
            ('Shubham', 'Ruchika'),
            (  'India',     'USA'),
            (    '88K',     '99K'),
            (   'Pune',  'Mumbai')],
           )

In [63]:
df = pd.read_csv(path + 'example',names=['col1'])   #  defines only 1 column whereas 4 columns are presentin the file  
df

                             col1
a       b       c               d
Shubham Ruchika Kushal     Milind
India   USA     UK         France
88K     99K     10K           11K
Pune    Mumbai  Delhi   Bangalore

In [64]:
df.index

MultiIndex([(      'a',       'b',      'c'),
            ('Shubham', 'Ruchika', 'Kushal'),
            (  'India',     'USA',     'UK'),
            (    '88K',     '99K',    '10K'),
            (   'Pune',  'Mumbai',  'Delhi')],
           )

In [65]:
df = pd.read_csv(path + 'example',index_col='a')      # utilize column 'a' as an index
df

               b       c          d
a
Shubham  Ruchika  Kushal     Milind
India        USA      UK     France
88K          99K     10K        11K
Pune      Mumbai   Delhi  Bangalore

In [66]:
df = pd.read_csv(path + 'example',index_col=['a','b'])      # utilize 2 columns 'a','b' as an index
df

                      c          d
a       b
Shubham Ruchika  Kushal     Milind
India   USA          UK     France
88K     99K         10K        11K
Pune    Mumbai    Delhi  Bangalore

In [67]:
df = pd.read_csv(path + 'example',index_col=0)      # utilize 0th column as an index   interview question
df

               b       c          d
a
Shubham  Ruchika  Kushal     Milind
India        USA      UK     France
88K          99K     10K        11K
Pune      Mumbai   Delhi  Bangalore

In [68]:
df = pd.read_csv(path + 'example',index_col=1)      # utilize 1st column as an index
df

               a       c          d
b
Ruchika  Shubham  Kushal     Milind
USA        India      UK     France
99K          88K     10K        11K
Mumbai      Pune   Delhi  Bangalore

In [69]:
df = pd.read_csv(path + 'example',index_col=[0,1])      # utilize 0th and 1st column as an index
df

                      c          d
a       b
Shubham Ruchika  Kushal     Milind
India   USA          UK     France
88K     99K         10K        11K
Pune    Mumbai    Delhi  Bangalore

In [70]:
df = pd.read_csv(path + 'example',usecols=['a','b'])      # Selects only column a and b
df

         a        b
0  Shubham  Ruchika
1    India      USA
2      88K      99K
3     Pune   Mumbai

In [71]:
df = pd.read_csv(path + 'example',usecols=['a','b','c'])      # Selects only column a, b and c
df

         a        b       c
0  Shubham  Ruchika  Kushal
1    India      USA      UK
2      88K      99K     10K
3     Pune   Mumbai   Delhi

In [74]:
df = pd.read_csv(path + 'example',usecols=['a'])      # Selects only column a, expects a list for usecols parameter so need to provide square brackets  
#       usecols require list so should be enclosed in [] interview question
print(df)
print(type(df))  # DataFrame

         a
0  Shubham
1    India
2      88K
3     Pune
<class 'pandas.core.frame.DataFrame'>

In [75]:
df = pd.read_csv(path + 'example',usecols=['a'], squeeze=True)      # Selects only column a, expects a list for usecols parameter so need to provide square brackets  
# Squeeze: converts single column to Series and not a frame
print(df)
print(type(df))        # this becomes seties instead of DataFrame

0    Shubham
1      India
2        88K
3       Pune
Name: a, dtype: object
<class 'pandas.core.series.Series'>

In [62]:
df = pd.read_csv(path + 'example',usecols=['a','b'], squeeze=True)      # Selects only column a, expects a list for usecols parameter so need to provide square brackets  
# Squeeze: converts single column to Series and not a frame
print(df)
print(type(df))        # this becomes DataFrame as Series requires only single column, Squeeze doesnot made any impact

       a       b
0  Mayur   Vipul
1  India     USA
2    88K     99K
3   Pune  Mumbai
<class 'pandas.core.frame.DataFrame'>

In [76]:
df = pd.read_csv(path + 'example',prefix='X', header=None)  # header = None, means do not consider any header, prefix is used for naming column with prefix vlaue, in this case 'X'
df

        X0       X1      X2         X3
0        a        b       c          d
1  Shubham  Ruchika  Kushal     Milind
2    India      USA      UK     France
3      88K      99K     10K        11K
4     Pune   Mumbai   Delhi  Bangalore

In [77]:
df = pd.read_csv(path + 'example',prefix='ColumnName', header=None)  # header = None, means do not consider any header, prefix is used for naming column with prefix vlaue, in this case 'ColumnName'
df

  ColumnName0 ColumnName1 ColumnName2 ColumnName3
0           a           b           c           d
1     Shubham     Ruchika      Kushal      Milind
2       India         USA          UK      France
3         88K         99K         10K         11K
4        Pune      Mumbai       Delhi   Bangalore

In [78]:
df = pd.read_csv(path + 'newexample.csv')   
df

   col1int  col2float    colstr
0       12       3.45      Amit
1      100       7.60  Narendra
2        2       3.22  Prafulla

In [79]:
print(type(df['col1int']))
print(type(df['col2float']))
print(type(df['colstr']))
print('\n')
print(type(df['col1int'][0]))
print(type(df['col2float'][0]))
print(type(df['colstr'][0]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>


<class 'numpy.int64'>
<class 'numpy.float64'>
<class 'str'>

In [80]:
df = pd.read_csv(path + 'newexample.csv',dtype={'col1int': np.float32, 'col2float': np.float64,
    'colstr': np.str})    # you can read column as you want. Float values would not be converted to int though but viceaversa is true
df

   col1int  col2float    colstr
0     12.0       3.45      Amit
1    100.0       7.60  Narendra
2      2.0       3.22  Prafulla

In [81]:
print(type(df['col1int']))
print(type(df['col2float']))
print(type(df['colstr']))
print('\n')
print(type(df['col1int'][0]))
print(type(df['col2float'][0]))
print(type(df['colstr'][0]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>


<class 'numpy.float32'>
<class 'numpy.float64'>
<class 'str'>

In [82]:
# Example file content is 
# a,b,c,d
# Mayur,Vipul,Mahesh,Vaibhav
# India,USA,UK,France
# 88K,99K,10K,11K
# Pune,Mumbai,Delhi,Bangalore

df = pd.read_csv(path + 'example', skiprows=2)  # assuming header is present
df

  India     USA     UK     France
0   88K     99K    10K        11K
1  Pune  Mumbai  Delhi  Bangalore

In [83]:
# Example file content is 
# a,b,c,d
# Mayur,Vipul,Mahesh,Vaibhav
# India,USA,UK,France
# 88K,99K,10K,11K
# Pune,Mumbai,Delhi,Bangalore

df = pd.read_csv(path + 'example', skiprows=2, header=None)
df

       0       1      2          3
0  India     USA     UK     France
1    88K     99K    10K        11K
2   Pune  Mumbai  Delhi  Bangalore

In [84]:
# Example file content is 
# a,b,c,d
# Mayur,Vipul,Mahesh,Vaibhav
# India,USA,UK,France
# 88K,99K,10K,11K
# Pune,Mumbai,Delhi,Bangalore
df = pd.read_csv(path + 'example', nrows=2) # Default header is present, read firt 2 rows
df

         a        b       c       d
0  Shubham  Ruchika  Kushal  Milind
1    India      USA      UK  France

In [85]:
# Example file content is 
# a,b,c,d
# Mayur,Vipul,Mahesh,Vaibhav
# India,USA,UK,France
# 88K,99K,10K,11K
# Pune,Mumbai,Delhi,Bangalore
df = pd.read_csv(path + 'example', nrows=0) # Default header is present, read firt 0 rows
df

Empty DataFrame
Columns: [a, b, c, d]
Index: []

In [86]:
# Example file content is 
# a,b,c,d
# Mayur,Vipul,Mahesh,Vaibhav
# India,USA,UK,France
# 88K,99K,10K,11K
# Pune,Mumbai,Delhi,Bangalore
df = pd.read_csv(path + 'example', nrows=20) # Default header is present, nrows should always be >=0, more than actual rows allowed
df

         a        b       c          d
0  Shubham  Ruchika  Kushal     Milind
1    India      USA      UK     France
2      88K      99K     10K        11K
3     Pune   Mumbai   Delhi  Bangalore

In [90]:
# Example file content is 
# a,b,c,d
# Mayur,Vipul,Mahesh,Vaibhav
# India,USA,UK,France
# 88K,99K,10K,11K
# 
#
# Pune,Mumbai,Delhi,Bangalore
df = pd.read_csv(path + 'examplewithblanklines', skip_blank_lines=True) 
df

       a       b       c          d
0  Mayur   Vipul  Mahesh    Vaibhav
1  India     USA      UK     France
2    88K     99K     10K        11K
3   Pune  Mumbai   Delhi  Bangalore

In [95]:
# Example file content is 
# a,b,c,d
# Mayur,Vipul,Mahesh,Vaibhav
# India,USA,UK,France
# 88K,99K,10K,11K
# 
#
# Pune,Mumbai,Delhi,Bangalore
df = pd.read_csv(path + 'examplewithblanklines', skip_blank_lines=False,verbose=True) #  default value, default value of skip_blank_lines=True
df

Tokenization took: 0.00 ms
Type conversion took: 0.50 ms
Parser memory cleanup took: 0.00 ms

       a       b       c          d
0  Mayur   Vipul  Mahesh    Vaibhav
1  India     USA      UK     France
2    88K     99K     10K        11K
3    NaN     NaN     NaN        NaN
4    NaN     NaN     NaN        NaN
5   Pune  Mumbai   Delhi  Bangalore

In [96]:
df.to_csv(path+'newfileindextrue',index=True)
df.to_csv(path+'newfileindexfalse',index=False)

In [97]:
df1=pd.read_csv(path+'newfileindexfalse')
df1

       a       b       c          d
0  Mayur   Vipul  Mahesh    Vaibhav
1  India     USA      UK     France
2    88K     99K     10K        11K
3    NaN     NaN     NaN        NaN
4    NaN     NaN     NaN        NaN
5   Pune  Mumbai   Delhi  Bangalore

In [98]:
df2=pd.read_csv(path+'newfileindextrue')
df2

   Unnamed: 0      a       b       c          d
0           0  Mayur   Vipul  Mahesh    Vaibhav
1           1  India     USA      UK     France
2           2    88K     99K     10K        11K
3           3    NaN     NaN     NaN        NaN
4           4    NaN     NaN     NaN        NaN
5           5   Pune  Mumbai   Delhi  Bangalore

In [111]:
# Read fixed width formatted lines into dataframe
df3=pd.read_fwf(path+'fixedwidthfile.txt', widths=[11,11])   # reads 10 characters for each field

  FirstName S       urname
0       Vipul        Shaha
1      Mahesh          Dua
2      Vedant        Verma
3       Manan  Agarwal  sd
4      Atharv  Nikam123456

In [132]:
# Excel file reading

In [112]:
dfe = pd.read_excel(path+'excelfile1.xlsx') # By default first sheet is read

In [113]:
dfe

  FirstName MiddleName    SurName Salary
0   Gaurav      Suresh      Nikam    10K
1     Ayush    Sandeep       Ohal    20K
2    Adwait     Neeraj      Raite    30K
3   Raviraj   Sambhaji  Dhamdhere    40K
4    Nilesh     Sharad      Sable    50K

In [114]:
dfe = pd.read_excel(path+'excelfile1.xlsx', sheet_name='salarydata')   # only salarydata sheet is read

In [115]:
dfe

   deptid  empid  salary
0      10    100    1000
1      20    200    2000
2      30    300    3000
3      40    400    4000

In [140]:
dfe = pd.read_excel(path+'excelfile1.xlsx', sheet_name=1)   # only salarydata sheet is read

In [141]:
dfe

   deptid  empid  salary
0      10    100    1000
1      20    200    2000
2      30    300    3000
3      40    400    4000

In [116]:
dfe = pd.read_excel(path+'excelfile1.xlsx', sheet_name=0)   # only employee sheet is read   interview question

In [117]:
dfe

  FirstName MiddleName    SurName Salary
0   Gaurav      Suresh      Nikam    10K
1     Ayush    Sandeep       Ohal    20K
2    Adwait     Neeraj      Raite    30K
3   Raviraj   Sambhaji  Dhamdhere    40K
4    Nilesh     Sharad      Sable    50K

In [118]:
dfe = pd.read_excel(path+'excelfile1.xlsx', sheet_name=2)   # 3rd sheet contains no data

In [119]:
dfe

Empty DataFrame
Columns: []
Index: []

In [120]:
dfe = pd.read_excel(path+'excelfile1.xlsx', sheet_name=40)  # Error out as 41st sheet is not available in excel file

IndexError: list index out of range

In [121]:
dfe = pd.read_excel(path+'excelfile1.xlsx', sheet_name=-3) # -1:sheet3, -2:salarydata, -3:employee : reverorder like string or list index
dfe    # interview question

  FirstName MiddleName    SurName Salary
0   Gaurav      Suresh      Nikam    10K
1     Ayush    Sandeep       Ohal    20K
2    Adwait     Neeraj      Raite    30K
3   Raviraj   Sambhaji  Dhamdhere    40K
4    Nilesh     Sharad      Sable    50K

In [122]:
dfe = pd.read_excel(path+'excelfile1.xlsx', sheet_name=-1) # -1:sheet3, -2:salarydata, -3:employee : reverorder like string or list index
dfe

Empty DataFrame
Columns: []
Index: []

In [123]:
dfe = pd.read_excel(path+'excelfile1.xlsx', sheet_name=-2) # -1:sheet3, -2:salarydata, -3:employee : reverorder like string or list index
dfe

   deptid  empid  salary
0      10    100    1000
1      20    200    2000
2      30    300    3000
3      40    400    4000

In [124]:
dfe = pd.read_excel(path+'excelfile1.xlsx', sheet_name=[0,1])   # interview question

In [125]:
type(dfe)

collections.OrderedDict

In [126]:
dfe

OrderedDict([(0,   FirstName MiddleName    SurName Salary
              0   Gaurav      Suresh      Nikam    10K
              1     Ayush    Sandeep       Ohal    20K
              2    Adwait     Neeraj      Raite    30K
              3   Raviraj   Sambhaji  Dhamdhere    40K
              4    Nilesh     Sharad      Sable    50K),
             (1,    deptid  empid  salary
              0      10    100    1000
              1      20    200    2000
              2      30    300    3000
              3      40    400    4000)])

In [127]:
dfe[0]

  FirstName MiddleName    SurName Salary
0   Gaurav      Suresh      Nikam    10K
1     Ayush    Sandeep       Ohal    20K
2    Adwait     Neeraj      Raite    30K
3   Raviraj   Sambhaji  Dhamdhere    40K
4    Nilesh     Sharad      Sable    50K

In [128]:
dfe[1]

   deptid  empid  salary
0      10    100    1000
1      20    200    2000
2      30    300    3000
3      40    400    4000

In [130]:
# Copy below 5 lines using ctrl+c to take those in clipboard

#col1,col2,col3
#1,2,3
#4,5,6
#7,8,9
#10,11,12

dfc = pd.read_clipboard(sep=',')
dfc

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9
3    10    11    12

# Read HTML file
## HTML

You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

From Anaconda prompt run below command as an administrator or priviledges having admin

- conda install lxml
- conda install html5lib
- conda install BeautifulSoup4

Then restart Jupyter Notebook. (or use pip install if you aren't using the Anaconda Distribution)
Pandas can read table tabs off of html. For example:

In [131]:
import pandas as pd
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
type(df)

URLError: <urlopen error [Errno 11001] getaddrinfo failed>

In [20]:
df

[                               Bank Name        City  ST   CERT  \
 0       City National Bank of New Jersey      Newark  NJ  21111
 1                          Resolute Bank      Maumee  OH  58317
 2                  Louisa Community Bank      Louisa  KY  58112
 3                   The Enloe State Bank      Cooper  TX  10716
 4    Washington Federal Bank for Savings     Chicago  IL  30570
 ..                                   ...         ...  ..    ...
 554                   Superior Bank, FSB    Hinsdale  IL  32646
 555                  Malta National Bank       Malta  OH   6629
 556      First Alliance Bank & Trust Co.  Manchester  NH  34264
 557    National State Bank of Metropolis  Metropolis  IL   3815
 558                     Bank of Honolulu    Honolulu  HI  21029

                    Acquiring Institution       Closing Date       Updated Date
 0                        Industrial Bank   November 1, 2019  December 19, 2019
 1                     Buckeye State Bank   October 25, 2019  December 19, 2019
 2      Kentucky Farmers Bank Corporation   October 25, 2019  December 19, 2019
 3                     Legend Bank, N. A.       May 31, 2019  December 19, 2019
 4                     Royal Savings Bank  December 15, 2017      July 24, 2019
 ..                                   ...                ...                ...
 554                Superior Federal, FSB      July 27, 2001    August 19, 2014
 555                    North Valley Bank        May 3, 2001  November 18, 2002
 556  Southern New Hampshire Bank & Trust   February 2, 2001  February 18, 2003
 557              Banterra Bank of Marion  December 14, 2000     March 17, 2005
 558                   Bank of the Orient   October 13, 2000     March 17, 2005

 [559 rows x 7 columns]]

In [21]:
len(df)

1

In [22]:
df[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019","December 19, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","December 19, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","December 19, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","December 19, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
...,...,...,...,...,...,...,...
554,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
555,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
556,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
557,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
558,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [25]:
df[0].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 559 entries, 0 to 558
Data columns (total 7 columns):
Bank Name                559 non-null object
City                     559 non-null object
ST                       559 non-null object
CERT                     559 non-null int64
Acquiring Institution    559 non-null object
Closing Date             559 non-null object
Updated Date             559 non-null object
dtypes: int64(1), object(6)
memory usage: 30.7+ KB

# Reading Json file

In [32]:
import pandas as pd 
  
# Create URL to JSON file (alternatively this can be a filepath)
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json'

# Load the first sheet of the JSON file into a data frame
#df = pd.read_json(url, orient='columns')
#df = pd.read_json(url, orient='index')
#df = pd.read_json(url, orient='values')
df = pd.read_json(url, orient='records')

# View the first ten rows
df.head(10)


# To understand what is this json, Online json file convertor link: http://jsoneditoronline.org/

   integer            datetime  category
0        5 2015-01-01 00:00:00         0
1        5 2015-01-01 00:00:01         0
2        9 2015-01-01 00:00:02         0
3        6 2015-01-01 00:00:03         0
4        6 2015-01-01 00:00:04         0
5        9 2015-01-01 00:00:05         0
6        7 2015-01-01 00:00:06         0
7        1 2015-01-01 00:00:07         0
8        6 2015-01-01 00:00:08         0
9        9 2015-01-01 00:00:09         0

In [ ]:
# Long form of PAndas is :  Panel Data

In [132]:
pd.__version__

'0.25.1'

In [133]:
pd.__name__

'pandas'

In [134]:
pd.read_json?